from math import sin, pi

"""
Расчет коэффициентов апроксимации для сглаживания экспериментальной
зависимости
"""
# "степень" тригонометрического полинома
k_s = [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 20, 25, 30, 35, 40, 45] 
m = 5  #  полуинтервал скользящего базового интервала
b_j_s_k = {}
for k in k_s:
    b_j_s = []
    for j in range(-m, m+1):
        if j == -m or j == m:
            b_j = (-1)**k*1/(2*(2**0.5)*m)
        elif j == 0:
            b_j = (2*k + 1)/2/m
        else:
            b_j = 1/(2*m)*sin(pi*(k+0.5)*j/m)/sin(pi*j/2/m)
        b_j_s.append(b_j)
    b_j_s_k[k] = b_j_s
for key, value in b_j_s_k.items():
    print(
        f"""степень" тригонометрического полинома: {key}
        \nчисленные значения коэффициентов: {value}"""
    )
